src/Catalogs/узЗадачи/узЗадачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="33ee2945-a302-44ac-a8b6-152205a57775">
  <name>узЗадачи</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="2f25c8d3-27d9-4ef7-addf-fba2e288e7c7">
    <name>ЭтоОсновнаяЗадача</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0ba7cac9-af0c-4b78-9371-7cc21b80d923">
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bb935ffd-92ef-4182-956b-379c0583df52">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0dd6c8fd-bf42-488f-a658-9344383808ac">
    <name>СрокИсполнения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="af3e6f87-f73c-4404-b298-acccebc8fddd">
    <name>ОформлениеТекста</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="270e66be-632f-4a4e-bd93-d6fa987edf34">
    <name>ПоказыватьКод</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="806f1384-fc6d-44f3-94e7-71cc0f69b318">
    <name>ПоказыватьТаблицу</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8f1ef4c4-fa08-4150-8b39-2ab537d98d1b">
    <name>КомментарииВКоде</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="589e21ac-61ed-4946-8965-ceec3bb85338">
    <name>ТекстСодержания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="767f9bec-0c1a-413c-a536-a3e6d6383ab2">
    <name>Конфигурация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b40e5381-0500-4391-963d-0f6c6753391b">
    <name>ПроверитьВыполнение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9453c86b-2011-461f-92ce-882a6eea7f37">
    <name>ДатаВыполнения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c6489755-f243-4356-bf22-0f10ac9a2818">
    <name>Важность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dc9096a2-e395-46d8-a9f3-0c7d6cf386c9">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="90257ba3-0c0f-4e35-ba56-2bf1c99972fd">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cf043d1d-7292-4451-893a-d399838a213e">
    <name>НомерВнешнейЗаявки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6c6fd310-7418-4c7a-9e68-8520de1d6eb3">
    <name>URLВнешнейЗаявки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="66d3f4d0-0614-4003-b133-50a64b13283e">
    <name>ГруппаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="21c02852-d755-488d-8f07-b621b18c2715">
    <name>ПоказыватьВОтчетахИКанбанДоске</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f89ba60b-7fb3-46b8-a109-1cda93ee05f1">
    <name>ОсновнаяЗадача</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c182f64b-fa93-49c1-a6ce-06016e4f7dbe">
    <name>Проект</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="15e99e57-0f06-49ee-a410-101a56136453">
    <name>ВКакойСпринтПришла</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2c89fe76-09c2-4953-b0fe-e4d90ababf55">
    <name>ВКакойСпринтСделали</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ceee9994-92d6-4c1f-a2c9-f7b8e2b87e30">
    <name>ДатаСоздания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d2397742-7412-45b2-bd27-350db3bfd77e">
    <name>ДатаНачалаРаботПоЗадаче</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="68e334b8-5d48-4a6a-b95f-8be6ce2d7ab3">
    <name>ДатаПередачиИсполнителю</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ebce951a-ce63-4799-af93-67017e43eab3">
    <name>ДатаПоследнегоИзменения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e0525be5-a5a6-4dba-8d11-49fbec2fd16f">
    <name>АвторПоследнегоИзменения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fe1d34e9-6082-4053-902c-31356fc2f325">
    <name>ЧасыПлан</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="527b8a61-dd54-4361-b60b-2362d42a5299">
    <name>ЧасыКОплате</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ГОтдел</name>
    <type>
      <types>CatalogRef.ОтделГандива</types>
    </type>
  </attributes>
  <attributes>
    <name>ГКатегория</name>
    <type>
      <types>CatalogRef.КатегорияГандива</types>
    </type>
  </attributes>
  <attributes>
    <name>ГТип</name>
    <type>
      <types>CatalogRef.ТипГандива</types>
    </type>
  </attributes>
  <attributes>
    <name>ГВид</name>
    <type>
      <types>CatalogRef.ВидГандива</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийТелефон</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКомпьютера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаОтветственности</name>
    <type>
      <types>CatalogRef.ГруппыОтветственности</types>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="0d958c66-1f6d-4b4a-a9ce-2a378e7394ad">
    <name>История</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="bde56cb0-2c4d-47dc-b0a6-7ca648109c89">
      <name>Автор</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="51699731-dbcc-4970-a156-7f965b8d27ec">
      <name>Событие</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e9bede99-e82a-4903-935c-6a4223e91b3f">
      <name>ДатаСобытия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="157e7cad-4a7f-4e38-a3ce-1231dfd2c94f">
      <name>ВидСобытия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="a24b2716-ecfd-4f80-a7ff-7d163ef97f26">
    <name>ИсторияСтатусов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="861d3596-405e-465f-a41c-d6f613fd516d">
      <name>Статус</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b6c5d2da-e08a-4b25-9b63-09041c2b9856">
      <name>ДатаОкончания</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="710e32e9-be92-4cb2-b99e-68afb7ceca73">
      <name>Исполнитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="faaf517a-72b6-495f-9336-5a312f4fda73">
      <name>ДатаНачала</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="53dbec50-fd8e-48cd-a281-a466b044f83f">
    <name>НаблюдателиЗаОсновнойЗадачей</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="b897a187-c8bb-46f2-9578-18bb3b665c6c">
      <name>Пользователь</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="32bd6f01-be42-4b80-8f99-606a73429530">
    <name>Комментарии</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="8f057c27-6387-4571-9d94-0b5f8e4bcda9">
      <name>Выполнено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c678b6ff-c0ca-45b4-84f6-c19eb54e39b7">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a02c92de-28c5-4b58-9317-8118cb19a211">
      <name>ДатаКомментария</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e88f57dc-b78c-40a6-9af4-c526d80bd917">
      <name>Автор</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>id</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="e94d8f35-befd-471a-93fb-deb34f472ab6">
      <name>КлючСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="8071bc0e-88fb-4dc1-97fa-c1d867055379">
    <name>ДопРеквизитыМножественные</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0a581de3-92ca-429d-bbd2-81ac2fa112e7">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e803a602-9d9c-4d02-aabc-82589596b6a4">
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c628c25f-9e37-4164-a34a-99e6dfffd90f">
      <name>КлючСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Согласующие</name>
    <attributes>
      <name>ФИО</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласовал</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/узОформлениеТекста/узОформлениеТекста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="5b6ff570-62c2-42f4-b206-490e1bcf32b1">
  <name>узОформлениеТекста</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="5168d756-f8ea-443f-8c5f-872e36c99078">
    <name>Текст</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a461176e-9a50-4392-9bcd-7d6235770fe6">
    <name>ФорматированныйТекст</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c2259309-194f-42bf-a86b-b93f5c5a2b50">
    <name>Markdown</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="579baaa4-6493-4d99-8744-6399757295c7">
  <name>Пользователи</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Почта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проффесия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="7f6597ab-464f-4a06-b5f1-a940be994f17">
    <name>узКороткоеИмя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7ee1e0d0-9735-45da-bd24-c0dbabfd5b1e">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ae6d0e12-8857-476c-b4b2-f03295cbed3e">
    <name>Недействителен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cc8e3172-491d-45d8-a7eb-fc6c400845cb">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d7cfc87f-ac09-44aa-91d9-6511c408c5cb">
    <name>ФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГПочта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГПароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдПользователяГандива</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/узЗадачи/Forms/ФормаЭлемента/Module.bsl
&После("ПриОткрытии")
&НаКлиенте
Процедура Расш1_ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
	Объект.ОформлениеТекста = ПолучитьОформлениеТекста();
	Если Объект.ОформлениеТекста = ПредопределенноеЗначение("Перечисление.узОформлениеТекста.Markdown") Тогда
		Если ЗначениеЗаполнено(Объект.ТекстСодержания) Тогда
			Элементы.ГруппаСтраницыОформлениеСодержания.ТекущаяСтраница = Элементы.ГруппаСтраницаПросмотр;
		Иначе
			Элементы.ГруппаСтраницыОформлениеСодержания.ТекущаяСтраница = Элементы.ГруппаСтраницаТекст;
		Конецесли;
	Конецесли;
	ОформлениеТекстаПриИзмененииНаСервере();
	ВыполнитьДействиеДляСтраницы();
КонецПроцедуры

&наСервере
функция ПолучитьОформлениеТекста()
	Возврат Перечисления.узОформлениеТекста.Markdown;
КонецФункции


&НаСервере
Процедура ПриОткрытииНаСервере()
	РегламентГандива.ОбновитьТокенГандива();
	Коменты = РегламентГандива.ОтправитьЗапросГандива("/Requests/"+СтрЗаменить(Строка(Объект.Код),Символы.НПП,"")+"/Comments","GET",, Истина);
	КоментыСрук = РегламентГандива.ПолучитьСтруктуруИзСоответствия(Коменты);
	Если КоментыСрук.Количество() > 0 Тогда
		Объект.Комментарии.Очистить();
		Для каждого стр из КоментыСрук Цикл
			нСтр = Объект.Комментарии.Добавить();
			нСтр.Автор= РегламентГандива.СоздатьИлиНайтиПользователя(стр.Author);
			нСтр.Комментарий = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(стр.Text,"<p>",""),"<br />",Символы.ПС),"</p>",Символы.ПС),"&nbsp"," ");
			нСтр.ID = стр.Id;
			нстр.КлючСтроки = нстр.ID;
			
		КонецЦикла;
	КонецЕсли;
	
	
	
	
	
	
	
	ДанныеЗ = РегламентГандива.ОтправитьЗапросГандива("/Requests/"+СтрЗаменить(Строка(Объект.Код),Символы.НПП,"")+"?isFast=true","GET",, Истина);
	//Объект.ДопРеквизитыМножественные.Очистить();
	Соглас = ДанныеЗ.Получить("Approvers");
	Если ЗначениеЗаполнено(Соглас) Тогда
		
		Объект.Согласующие.Очистить();
		Для каждого стр из Соглас Цикл
			нстр = Объект.Согласующие.Добавить();
			нстр.ФИО = Справочники.Пользователи.НайтиПоРеквизиту("ИдПользователяГандива",стр.Получить("Id"));
			Если стр.Получить("Status") = 3 тогда
				нстр.Согласовал = Истина;
			Иначе
				нстр.Согласовал = Ложь;
			конецЕсли;
			нстр.Дата = ПреобразоватьДату(стр.Получить("ResolutionDate"));
			
		КонецЦикла;
		
		
	КонецЕсли;
	
	
	Хэштеги = ДанныеЗ.Получить("HashTags");
	Объект.ДопРеквизитыМножественные.Очистить();
	Для каждого стр из Хэштеги цикл
		СтрокаДопРеквизитыМножественные = Объект.ДопРеквизитыМножественные.Добавить();	
		СтрокаДопРеквизитыМножественные.Свойство = Свойство_МеткаЗадачи;
		СтрокаДопРеквизитыМножественные.КлючСтроки = "" + Новый УникальныйИдентификатор;
		СтрокаДопРеквизитыМножественные.Значение = Справочники.узМеткиЗадач.НайтиПоНаименованию(стр);		
	КонецЦикла;
	ОбновитьВидимостьКомандаМетки();
	ОбновитьОтображениеМетокЗадачи();
	
КонецПроцедуры

Функция ПреобразоватьДату(Дата)
	Попытка	
		ДатаВремя = Дата;
		Дата1С = Дата(Сред(ДатаВремя, 1, 4), 
		Сред(ДатаВремя, 6, 2), 
		Сред(ДатаВремя, 9, 2), 
		Сред(ДатаВремя, 12, 2), 
		Сред(ДатаВремя, 15, 2), 
		Сред(ДатаВремя, 18, 2));
		
		Возврат Дата1С;
	Исключение
		Возврат Дата("00010101");
	КонецПопытки;
КонецФункции

&НаКлиенте
Процедура Расш1_НаписатьКоментарийПосле(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеВводаЗначения", 
	ЭтотОбъект);	
	
	ПоказатьВводЗначения(
	Оповещение,
	, // пропускаем начальное значение
	"Напишите комментарий",
	"Строка"
	);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВводаЗначения(Результат, Параметры) Экспорт	
	
	Если Не Результат = Неопределено Тогда
		ОтправитьКомментарийНаСервере(Результат);
		ПриОткрытииНаСервере();
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ОтправитьКомментарийНаСервере(Комент)
	
	ТелоЗапроса = "{""parentCommentId"":0,""text"":"""+Строка(Комент)+""",""addressees"":[0]}";
	ДанныеАвторизация = Новый Структура;
	ДанныеАвторизация.Вставить("Логин", Пользователи.ТекущийПользователь());
	Результат = РегламентГандива.ОтправитьЗапросГандиваАвторизация(
	"/Requests/"+СтрЗаменить(Строка(Объект.Код),Символы.НПП,"")+"/Comments",
	"POST",
	ТелоЗапроса,
	Истина
	,Истина, ДанныеАвторизация);
	
КонецФункции
